Revit 2024 API
BuiltInFailures.CurtainWallFailures.RuledCurtainElementLostCurves Property
 Ruled Curtain System cannot be built. The Lines or Edges used to create it cannot be found.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RuledCurtainElementLostCurves { get; }
Visual Basic
Public Shared ReadOnly Property RuledCurtainElementLostCurves As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RuledCurtainElementLostCurves {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace